olliw42/stm32ll-lib/src/stdstm32-uartb.h
//*******************************************************
// Copyright (c) OlliW, OlliW42, www.olliw.eu
// GPL3
// https://www.gnu.org/licenses/gpl-3.0.de.html
//*******************************************************
// my stripped down UART standard library
// only ISR, no DMA, no wait and tmo rx functions, no convenience functions
//*******************************************************
// Interface:
//
// #define UARTB_USE_UART1 , UARTB_USE_UART2 , UARTB_USE_UART3 , UARTB_USE_UART3REMAPPED, UARTB_USE_UART4, UARTB_USE_UART5
// #define UARTB_BAUD
//
// #define UARTB_USE_TX
// #define UARTB_TXBUFSIZE
// #define UARTB_USE_TX_ISR
// #define UARTB_USE_TX_DMA
//
// #define UARTB_USE_RX
// #define UARTB_RXBUFSIZE
//
// #define UARTB_IRQ_PRIORITY
//
// #define UARTB_USE_RXERRORCOUNT
//
// #define UARTB_RX_CALLBACK_FULL(c)
// #define UARTB_TC_CALLBACK() // ATTENTION: when used, one never should trigger TC isr without a byte written to the tx buffer
//
//*******************************************************
#ifndef STDSTM32_UARTB_H
#define STDSTM32_UARTB_H
#ifdef __cplusplus
extern "C" {
#endif


//-------------------------------------------------------
// Enums
//-------------------------------------------------------
// in order to not introduce hardware dependency upstream
// we define our own enums for parity and stopbits

#ifndef UART_ENUMS
#define UART_ENUMS

typedef enum {
  XUART_PARITY_NO = LL_USART_PARITY_NONE, // XUART_xxx to avoid overlap with HAL
  XUART_PARITY_EVEN = LL_USART_PARITY_EVEN,
  XUART_PARITY_ODD = LL_USART_PARITY_ODD,
  XUART_PARITY_MAKEITU32 = UINT32_MAX,
} UARTPARITYENUM;

typedef enum {
  UART_STOPBIT_0_5 = LL_USART_STOPBITS_0_5,
  UART_STOPBIT_1 = LL_USART_STOPBITS_1,
  UART_STOPBIT_1_5 = LL_USART_STOPBITS_1_5,
  UART_STOPBIT_2 = LL_USART_STOPBITS_2,
  UART_STOPBIT_MAKEITU32 = UINT32_MAX,
} UARTSTOPBITENUM;

#endif


//-------------------------------------------------------
// Defines
//-------------------------------------------------------

#include "stdstm32-peripherals.h"

#if (defined UARTB_USE_TX_ISR) && (!defined UARTB_USE_TX)
  #error UARTB_USE_TX_ISR used without UARTB_USE_TX!
#endif
#if (defined UARTB_USE_RXERRORCOUNT) && (!defined UARTB_USE_RX)
  #error UARTB_USE_RXERRORCOUNT used without UARTB_USE_RX!
#endif

#ifdef UARTB_USE_TX_DMA
  #error UARTB_USE_TX_DMA not supported by this library!
#endif


#ifndef UARTB_BAUD
  #define UARTB_BAUD             115200UL // 9600UL
#endif


#ifdef UARTB_USE_TX_ISR
  #ifndef UARTB_TXBUFSIZE
    #define UARTB_TXBUFSIZE      256 // MUST be 2^N
  #endif
  #if UARTB_TXBUFSIZE < 2
    #error UARTB_TXBUFSIZE must be larger than 1 !
  #elif ((UARTB_TXBUFSIZE & (UARTB_TXBUFSIZE-1)) != 0)
    #error UARTB_TXBUFSIZE must be a power of 2 !
  #endif

  #define UARTB_TXBUFSIZEMASK  (UARTB_TXBUFSIZE-1)

  volatile char uartb_txbuf[UARTB_TXBUFSIZE];
  volatile uint16_t uartb_txwritepos; // pos at which the last byte was stored
  volatile uint16_t uartb_txreadpos; // pos at which the next byte is to be fetched
#endif


#ifdef UARTB_USE_RX
  #ifndef UARTB_RXBUFSIZE
    #define UARTB_RXBUFSIZE      256 //128 //MUST be 2^N
  #endif
  #if UARTB_RXBUFSIZE < 2
    #error UARTB_RXBUFSIZE must be larger than 1 !
  #elif ((UARTB_RXBUFSIZE & (UARTB_RXBUFSIZE-1)) != 0)
    #error UARTB_RXBUFSIZE must be a power of 2 !
  #endif

  #define UARTB_RXBUFSIZEMASK  (UARTB_RXBUFSIZE-1)

  volatile char uartb_rxbuf[UARTB_RXBUFSIZE];
  volatile uint16_t uartb_rxwritepos; // pos at which the last byte was stored
  volatile uint16_t uartb_rxreadpos; // pos at which the next byte is to be fetched

  #ifdef UARTB_USE_RXERRORCOUNT
  volatile uint32_t uartb_errorcnt_rxnoise;
  volatile uint32_t uartb_errorcnt_rxframe;
  volatile uint32_t uartb_errorcnt_rxoverrun;
  #endif
#endif


#if defined UARTB_USE_UART1 || defined UARTB_USE_UART1_REMAPPED
  #define UARTB_UARTx             USART1
  #ifdef UARTB_USE_UART1
    #define UARTB_TX_IO           IO_PA9
    #define UARTB_RX_IO           IO_PA10
  #else
    #define UARTB_TX_IO           IO_PC4 // on G4
    #define UARTB_RX_IO           IO_PC5
  #endif
  #define UARTB_IO_AF             IO_AF_7
  #define UARTB_IRQn              USART1_IRQn
  #define UARTB_IRQHandler        USART1_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #endif

#elif defined UARTB_USE_UART2 || defined UARTB_USE_UART2_REMAPPED || defined UARTB_USE_UART2_REMAPPED2
  #define UARTB_UARTx             USART2
  #ifdef UARTB_USE_UART2
    #define UARTB_TX_IO           IO_PA2
    #define UARTB_RX_IO           IO_PA3
  #elif defined UARTB_USE_UART2_REMAPPED
    #define UARTB_TX_IO           IO_PD5
    #define UARTB_RX_IO           IO_PD6
  #elif defined UARTB_USE_UART2_REMAPPED2 // only G4
    #define UARTB_TX_IO           IO_PA14
    #define UARTB_RX_IO           IO_PA14
  #endif
  #define UARTB_IO_AF             IO_AF_7
  #define UARTB_IRQn              USART2_IRQn
  #define UARTB_IRQHandler        USART2_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #endif

#elif defined UARTB_USE_UART3 || defined UARTB_USE_UART3_REMAPPED || defined UARTB_USE_UART3REMAPPED
  #define UARTB_UARTx             USART3
  #if defined UARTB_USE_UART3 && defined STM32F3
    #define UARTB_TX_IO           IO_PB8
    #define UARTB_RX_IO           IO_PB9
  #elif defined UARTB_USE_UART3
    #define UARTB_TX_IO           IO_PB10
    #define UARTB_RX_IO           IO_PB11
  #else
    #define UARTB_TX_IO           IO_PC10
    #define UARTB_RX_IO           IO_PC11
  #endif
  #define UARTB_IO_AF             IO_AF_7
  #define UARTB_IRQn              USART3_IRQn
  #define UARTB_IRQHandler        USART3_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #endif

#elif defined UARTB_USE_UART4 || defined UARTB_USE_UART4_REMAPPED
  #define UARTB_UARTx             UART4
  #ifdef UARTB_USE_UART4
    #define UARTB_TX_IO           IO_PC10
    #define UARTB_RX_IO           IO_PC11
  #else
    #define UARTB_TX_IO           IO_PA0 // only F7 !
    #define UARTB_RX_IO           IO_PA1
  #endif
  #define UARTB_IRQn              UART4_IRQn
  #define UARTB_IRQHandler        UART4_IRQHandler
  #if defined STM32F1
    #define UARTB_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UARTB IO_AF & DMA for F3 still TODO
  #elif defined STM32F7
    #define UARTB_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTB_IO_AF           IO_AF_5
  #endif

#elif defined UARTB_USE_UART5
  #define UARTB_UARTx             UART5
  #define UARTB_TX_IO             IO_PC12
  #define UARTB_RX_IO             IO_PD2
  #define UARTB_IRQn              UART5_IRQn
  #define UARTB_IRQHandler        UART5_IRQHandler
  #if defined STM32F1
    #define UARTB_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UARTB IO_AF & DMA for F3 still TODO //TODO
  #elif defined STM32F7
    #define UARTB_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTB_IO_AF           IO_AF_5
  #endif

#elif defined UARTB_USE_UART6 || defined UARTB_USE_UART6_REMAPPED
  #define UARTB_UARTx             USART6
  #ifdef UARTB_USE_UART6
    #define UARTB_TX_IO           IO_PC6
    #define UARTB_RX_IO           IO_PC7
  #else
    #define UARTB_TX_IO           IO_PG14
    #define UARTB_RX_IO           IO_PG9
  #endif
  #define UARTB_IO_AF             IO_AF_8
  #define UARTB_IRQn              USART6_IRQn
  #define UARTB_IRQHandler        USART6_IRQHandler
  #if defined STM32F1
    #error UART6 NOT AVAILABLE !
  #elif defined STM32F3
    #error UART6 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32G4
    #error UART6 NOT AVAILABLE !
  #endif

#elif defined UARTB_USE_UART7 || defined UARTB_USE_UART7_REMAPPED
  #define UARTB_UARTx             UART7
  #ifdef UARTB_USE_UART7
    #define UARTB_TX_IO           IO_PE8
    #define UARTB_RX_IO           IO_PE7
  #else
    #define UARTB_TX_IO           IO_PF7
    #define UARTB_RX_IO           IO_PF6
  #endif
  #define UARTB_IO_AF             IO_AF_8
  #define UARTB_IRQn              UART7_IRQn
  #define UARTB_IRQHandler        UART7_IRQHandler
  #if defined STM32F1
    #error UART7 NOT AVAILABLE !
  #elif defined STM32F3
    #error UART6 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32G4
    #error UART7 NOT AVAILABLE !
  #endif

#elif defined UARTB_USE_UART8
  #define UARTB_UARTx             UART8
  #define UARTB_TX_IO             IO_PE1
  #define UARTB_RX_IO             IO_PE0
  #define UARTB_IO_AF             IO_AF_8
  #define UARTB_IRQn              UART8_IRQn
  #define UARTB_IRQHandler        UART8_IRQHandler
  #if defined STM32F1
    #error UART8 NOT AVAILABLE !
  #elif defined STM32F3
    #error UART8 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32G4
    #error UART8 NOT AVAILABLE !
  #endif

#else
  #error No UARTB_USE_UARTx defined!
#endif


//-------------------------------------------------------
// Glue macros
//-------------------------------------------------------
#if defined STM32F1
  #define REG_DR        DR
  #define REG_SR        SR
  #define FLAG_SR_RXNE  LL_USART_SR_RXNE
  #define FLAG_SR_ORE   LL_USART_SR_ORE
  #define FLAG_SR_NE    LL_USART_SR_NE
  #define FLAG_SR_FE    LL_USART_SR_FE
  #define FLAG_SR_TXE   LL_USART_SR_TXE
  #define FLAG_SR_TC    LL_USART_SR_TC
#elif defined STM32F3
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  LL_USART_ISR_RXNE
  #define FLAG_SR_ORE   LL_USART_ISR_ORE
  #define FLAG_SR_NE    LL_USART_ISR_NE
  #define FLAG_SR_FE    LL_USART_ISR_FE
  #define FLAG_SR_TXE   LL_USART_ISR_TXE
#elif defined STM32F7
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  LL_USART_ISR_RXNE
  #define FLAG_SR_ORE   LL_USART_ISR_ORE
  #define FLAG_SR_NE    LL_USART_ISR_NE
  #define FLAG_SR_FE    LL_USART_ISR_FE
  #define FLAG_SR_TXE   LL_USART_ISR_TXE
#elif defined STM32G4
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  LL_USART_ISR_RXNE_RXFNE
  #define FLAG_SR_ORE   LL_USART_ISR_ORE
  #define FLAG_SR_NE    LL_USART_ISR_NE
  #define FLAG_SR_FE    LL_USART_ISR_FE
  #define FLAG_SR_TXE   LL_USART_ISR_TXE_TXFNF
#endif


//-------------------------------------------------------
// ISR routine
//-------------------------------------------------------
#if defined UARTB_USE_RX || defined UARTB_USE_TX_ISR

void UARTB_IRQHandler(void)
{
  // Cube HAL for f103rc is also calling this first independent on irqs
  uint16_t usart_sr = LL_USART_ReadReg(UARTB_UARTx, REG_SR); // read USART_SR register

#ifdef UARTB_USE_RX
  if (usart_sr & FLAG_SR_RXNE) {
#ifdef UARTB_USE_RXERRORCOUNT
    if (usart_sr & FLAG_SR_ORE) uartb_errorcnt_rxoverrun++;
    if (usart_sr & FLAG_SR_NE) uartb_errorcnt_rxnoise++;
    if (usart_sr & FLAG_SR_FE) uartb_errorcnt_rxframe++;
#endif
    // Cube LL driver (for f103?) says that reading SR and then writing to DR will clear error flags, so do it after error checks
    uint8_t usart_dr = LL_USART_ReceiveData8(UARTB_UARTx); // read USART_DR register, clears RXNE and RX error flags
#ifdef UARTB_RX_CALLBACK_FULL
    UARTB_RX_CALLBACK_FULL(usart_dr);
#else
    uint16_t next = (uartb_rxwritepos + 1) & UARTB_RXBUFSIZEMASK;
    if (uartb_rxreadpos != next) { // fifo not full
      uartb_rxbuf[next] = usart_dr;
      uartb_rxwritepos = next;
    }
#endif
  }
#if defined STM32F1
  // ORE is enabled along with RXNE, so we need to handle it
  // ORE bit is reset by read to USART_SR followed by read to USART_DR
  if (usart_sr & FLAG_SR_ORE) {
    LL_USART_ReceiveData8(UARTB_UARTx); // read USART_DR register, clears RXNE and RX error flags
  }
#elif defined STM32F3
  // ORE is enabled along with RXNE, but can be cleared by writing 1 to ICR
  LL_USART_WriteReg(UARTB_UARTx, ICR, (LL_USART_ICR_ORECF|LL_USART_ICR_NCF|LL_USART_ICR_FECF|LL_USART_ICR_PECF|LL_USART_ICR_IDLECF));
#elif defined STM32F7
  #warning UARTB F7 check clear flags, should be LL !?
  // these are cleared by write 1 to the ICR register, not by a read of DR register!
  LL_USART_WriteReg(UARTB_UARTx, ICR, (USART_ICR_IDLECF | USART_ICR_ORECF | USART_ICR_NCF | USART_ICR_FECF | USART_ICR_PECF));
#elif defined STM32G4
  #warning UARTB G4 check clear flags, should be LL !?
  LL_USART_WriteReg(UARTB_UARTx, ICR, (USART_ICR_IDLECF | USART_ICR_ORECF | USART_ICR_NECF | USART_ICR_FECF | USART_ICR_PECF));
#endif
#endif

#ifdef UARTB_USE_TX_ISR
  if (usart_sr & FLAG_SR_TXE) {
    if (uartb_txwritepos != uartb_txreadpos) { // fifo not empty
      uartb_txreadpos = (uartb_txreadpos + 1) & UARTB_TXBUFSIZEMASK;
      LL_USART_TransmitData8(UARTB_UARTx, uartb_txbuf[uartb_txreadpos]); // write to USART_DR register, clears TXE flag, as well as TC
    } else {
      LL_USART_DisableIT_TXE(UARTB_UARTx); // disable interrupt when empty
#ifdef UARTB_TC_CALLBACK
      // ATTENTION: doesn't distinguish between empty fifo and last byte just send!
      LL_USART_ClearFlag_TC(UARTB_UARTx); // now enable TC interrupt
      LL_USART_EnableIT_TC(UARTB_UARTx);
#endif
    }
  }

#ifdef UARTB_TC_CALLBACK
  if (usart_sr & FLAG_SR_TC) {
    LL_USART_DisableIT_TC(UARTB_UARTx);
    LL_USART_ClearFlag_TC(UARTB_UARTx);
    UARTB_TC_CALLBACK();
  }
#endif
#endif
}

#endif // defined UARTB_USE_RX || defined UARTB_USE_TX_ISR


//-------------------------------------------------------
// TX routines
//-------------------------------------------------------
#ifdef UARTB_USE_TX

uint16_t uartb_putc(char c)
{
#ifndef UARTB_USE_TX_ISR
  while (!LL_USART_IsActiveFlag_TC(UARTB_UARTx)) {}
  LL_USART_TransmitData8(UARTB_UARTx, c);
  return 1;
#else
  uint16_t next = (uartb_txwritepos + 1) & UARTB_TXBUFSIZEMASK;
  if (uartb_txreadpos != next) { // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
    uartb_txbuf[next] = c;
    uartb_txwritepos = next;
    LL_USART_EnableIT_TXE(UARTB_UARTx); // enable interrupt // then TDR is empty, the TXE bit is set, and hence the isr is triggered
    return 1;
  }
  return 0;
#endif
}


void uartb_puts(const char *s)
{
  while (*s) {
    uartb_putc(*s);
    s++;
  }
}


void uartb_putbuf(uint8_t* buf, uint16_t len)
{
uint16_t i;

  for (i = 0; i < len; i++) uartb_putc(buf[i]);
}


#ifdef UARTB_USE_TX_ISR
uint16_t uartb_tx_notfull(void)
{
  uint16_t next = (uartb_txwritepos + 1) & UARTB_TXBUFSIZEMASK;
  return (uartb_txreadpos != next); // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
}


static inline uint16_t uartb_tx_isempty(void)
{
  if (uartb_txwritepos == uartb_txreadpos) return 1;
  return 0;
}


static inline void uartb_tx_flush(void)
{
  uartb_txwritepos = uartb_txreadpos = 0;
}
#else
static inline void uartb_tx_flush(void) {}
#endif

#endif // defined UARTB_USE_TX


//-------------------------------------------------------
// RX routines
//-------------------------------------------------------
#ifdef UARTB_USE_RX

static inline uint16_t uartb_rx_available(void)
{
  if (uartb_rxwritepos == uartb_rxreadpos) return 0; // fifo empty
  return 1;
}


uint16_t uartb_rx_bytesavailable(void)
{
int16_t d;

  d = (int16_t)uartb_rxwritepos - (int16_t)uartb_rxreadpos;
  return (d < 0) ? d + (UARTB_RXBUFSIZEMASK + 1) : d;
}


char uartb_getc(void)
{
  while (uartb_rxwritepos == uartb_rxreadpos) {};
  uartb_rxreadpos = (uartb_rxreadpos + 1) & UARTB_RXBUFSIZEMASK;
  return uartb_rxbuf[uartb_rxreadpos];
}


static inline char uartb_lookatnextc(void)
{
  return uartb_rxbuf[(uartb_rxreadpos + 1) & UARTB_RXBUFSIZEMASK];
}


static inline void uartb_rx_flush(void)
{
  uartb_rxwritepos = uartb_rxreadpos = 0;
}

#endif // defined UARTB_USE_RX


//-------------------------------------------------------
// INIT routines
//-------------------------------------------------------

void uartb_setprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
LL_USART_InitTypeDef USART_InitStruct = {0};

  LL_USART_StructInit(&USART_InitStruct);
  USART_InitStruct.BaudRate = baud;
  USART_InitStruct.DataWidth = (parity != LL_USART_PARITY_NONE) ? LL_USART_DATAWIDTH_9B : LL_USART_DATAWIDTH_8B;
  USART_InitStruct.StopBits = stopbits;
  USART_InitStruct.Parity = parity;
  USART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  LL_USART_Disable(UARTB_UARTx); // must be disabled to configure some registers
  LL_USART_Init(UARTB_UARTx, &USART_InitStruct);
  LL_USART_Enable(UARTB_UARTx);
}


void uartb_setbaudrate(uint32_t baud)
{
LL_USART_InitTypeDef USART_InitStruct = {0};

  LL_USART_StructInit(&USART_InitStruct);
  USART_InitStruct.BaudRate = baud;
  USART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  LL_USART_Disable(UARTB_UARTx); // must be disabled to configure some registers
  LL_USART_Init(UARTB_UARTx, &USART_InitStruct);
  LL_USART_Enable(UARTB_UARTx);
}


void uartb_tx_enable(FunctionalState flag)
{
#ifdef UARTB_USE_TX
  if (flag == ENABLE) {
    gpio_change_af(UARTB_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UARTB_IO_AF, IO_SPEED_VERYFAST);
  } else {
    gpio_change(UARTB_TX_IO, IO_MODE_INPUT_ANALOG, IO_SPEED_VERYFAST);
  }
#endif
}


void uartb_rx_enableisr(FunctionalState flag)
{
#ifdef UARTB_USE_RX
  if (flag == ENABLE) {
    // enable Receive Data register not empty interrupt
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UARTB_UARTx);
#endif
    LL_USART_EnableIT_RXNE(UARTB_UARTx);
  } else {
    LL_USART_DisableIT_RXNE(UARTB_UARTx);
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UARTB_UARTx);
#endif
  }
#endif
}


void uartb_init_isroff(void)
{
LL_USART_InitTypeDef USART_InitStruct = {0};

  LL_USART_Disable(UARTB_UARTx);

  // Initialize clocks for USART, GPIO, AFIO
  rcc_init_afio();
  rcc_init_uart(UARTB_UARTx);
#if defined UARTB_USE_UART3REMAPPED
  GPIO_PinRemapConfig(GPIO_PartialRemap_USART3, ENABLE); // RM0008 p. 175, Tab. 52
#endif

  // Configure pin USART Tx as alternative function push-pull
#ifdef UARTB_USE_TX
  gpio_init_af(UARTB_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UARTB_IO_AF, IO_SPEED_VERYFAST);
#endif

  // Configure pin USART Rx as input with pull up
#ifdef UARTB_USE_RX
  gpio_init_af(UARTB_RX_IO, IO_MODE_INPUT_PU, UARTB_IO_AF, IO_SPEED_VERYFAST);
#endif

  // Configure USART
  USART_InitStruct.BaudRate = UARTB_BAUD;
  USART_InitStruct.DataWidth = LL_USART_DATAWIDTH_8B;
  USART_InitStruct.StopBits = LL_USART_STOPBITS_1;
  USART_InitStruct.Parity = LL_USART_PARITY_NONE;
  USART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  USART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
  USART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
#if defined STM32G4
  USART_InitStruct.PrescalerValue = LL_USART_PRESCALER_DIV1;
#endif
  LL_USART_Init(UARTB_UARTx, &USART_InitStruct);
  LL_USART_ConfigAsyncMode(UARTB_UARTx);
#if defined STM32G4
  LL_USART_DisableFIFO(UARTB_UARTx);
  LL_USART_SetTXFIFOThreshold(UARTB_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
  LL_USART_SetRXFIFOThreshold(UARTB_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
#endif

  // Configure NVIC channel
#if defined UARTB_USE_RX || defined UARTB_USE_TX_ISR
#ifdef UARTB_PREEMPTIONPRIORITY
  #error Legacy UARTB_PREEMPTIONPRIORITY used !
#endif
#ifdef UARTB_SUBPRIORITY
  #error Legacy UARTB_SUBPRIORITY used !
#endif
#ifdef UARTB_PRIORITY
#error Legacy UARTB_PRIORITY used !
#endif
#ifndef UARTB_IRQ_PRIORITY
  #define UARTB_IRQ_PRIORITY  15 //set priority to lowest
#endif
  nvic_irq_enable_w_priority(UARTB_IRQn, UARTB_IRQ_PRIORITY);
#endif

#ifdef UARTB_USE_TX_ISR
  // Disable Transmit Data Register empty interrupt
  LL_USART_DisableIT_TXE(UARTB_UARTx);
  LL_USART_ClearFlag_TC(UARTB_UARTx);
  // Flush buffer
  uartb_txwritepos = uartb_txreadpos = 0;
#endif

#ifdef UARTB_USE_RX
  // Disable Receive Data register not empty interrupt
#ifdef STM32F1
  LL_USART_ClearFlag_RXNE(UARTB_UARTx);
#endif
  LL_USART_EnableIT_RXNE(UARTB_UARTx);
  // Flush buffer
  uartb_rxwritepos = uartb_rxreadpos = 0;
#ifdef UARTB_USE_RXERRORCOUNT
  uartb_errorcnt_rxnoise = 0;
  uartb_errorcnt_rxframe = 0;
  uartb_errorcnt_rxoverrun = 0;
#endif
#endif

  // Cube HAL for f103rc
  /* In asynchronous mode, the following bits must be kept cleared:
     - LINEN and CLKEN bits in the USART_CR2 register,
     - SCEN, HDSEL and IREN  bits in the USART_CR3 register.*/
  CLEAR_BIT(UARTB_UARTx->CR2, (USART_CR2_LINEN | USART_CR2_CLKEN));
  CLEAR_BIT(UARTB_UARTx->CR3, (USART_CR3_SCEN | USART_CR3_HDSEL | USART_CR3_IREN));

#if defined STM32F7
  // reading the F722 manual I've added this
  CLEAR_BIT(UARTB_UARTx->CR1, (USART_CR1_EOBIE | USART_CR1_RTOIE | USART_CR1_CMIE | USART_CR1_PEIE | USART_CR1_IDLEIE));
  CLEAR_BIT(UARTB_UARTx->CR2, (USART_CR2_RTOEN | USART_CR2_CPOL | USART_CR2_CPHA | USART_CR2_LBCL | USART_CR2_LBDIE | USART_CR2_LBDL));
  CLEAR_BIT(UARTB_UARTx->CR3, (USART_CR3_TCBGTIE | USART_CR3_CTSIE | USART_CR3_EIE));
#if !defined UARTB_USE_RXERRORCOUNT
  // disable ORE in the first place
  LL_USART_DisableOverrunDetect(UARTB_UARTx); // disables ORE, check how F1 is behaving
#endif
#endif
#if defined STM32G4 && !defined UARTB_USE_RXERRORCOUNT
#if !defined UARTB_USE_RXERRORCOUNT
  LL_USART_DisableOverrunDetect(UARTB_UARTx);
#endif
#endif

  // Enable USART
  LL_USART_Enable(UARTB_UARTx);

#if defined STM32G4
  // Polling UART initialisation
  while((!(LL_USART_IsActiveFlag_TEACK(UARTB_UARTx))) || (!(LL_USART_IsActiveFlag_REACK(UARTB_UARTx)))) {};
#endif
}


void uartb_init(void)
{
  uartb_init_isroff();
  uartb_rx_enableisr(ENABLE);
}


//-------------------------------------------------------
#ifdef __cplusplus
}
#endif
#endif // STDSTM32_UARTB_H
